app/views/flights/index.html.erb

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <li>
      Open Seats: <%= flight.airplane.rows * flight.airplane.cols - flight.reservations.count %> of <%= flight.airplane.rows * flight.airplane.cols %>