app/controllers/airplanes_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
  def index
    # headers['Access-Control-Allow-Origin'] = '*'
    # render json: Airplane.all
    @airplanes = Airplane.all

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @airplane = Airplane.find params[:id]

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @airplane = Airplane.find params[:id]

SELECT  "airplanes".* FROM "airplanes" WHERE "airplanes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "airplanes" SET "name" = $1, "rows" = $2, "cols" = $3, "updated_at" = $4 WHERE "airplanes"."id" = $5  [["name", nil], ["rows", nil], ["cols", nil], ["updated_at", "2021-01-06 00:48:39.225070"], ["id", 2]]
---
  def update
    airplane=Airplane.find params[:id]
    airplane.update airplane_params