app/controllers/application_controller.rb

    def fetch_user
      if session[:user_id].present?
      @current_user = User.find_by id: session[:user_id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]