app/controllers/flights_controller.rb

SELECT "airplanes".* FROM "airplanes"
---
  def new
    @flights = Flight.new
    @planes = Airplane.all.map{ |plane| [ plane.name, plane.id ] }

INSERT INTO "flights" ("scheduled", "to", "from", "created_at", "updated_at", "flight") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["scheduled", "2021-01-15"], ["to", "SFO"], ["from", "JFK"], ["created_at", "2021-01-06 03:13:01.843453"], ["updated_at", "2021-01-06 03:13:01.843453"], ["flight", 9]]
---
  def create
    Flight.create flight_params

SELECT "flights".* FROM "flights" WHERE "flights"."to" = $1 AND "flights"."from" = $2  [["to", "Sydney"], ["from", "Perth"]]
---
  def index
    headers['Access-Control-Allow-Origin'] = '*'

    if params[:to] || params[:from]
      @flights = Flight.where( to: params[:to], from: params[:from] )
    else
      @flights = Flight.all

SELECT "flights".* FROM "flights" WHERE "flights"."to" = $1 AND "flights"."from" = $2  [["to", "Sydney"], ["from", "Perth"]]
---
  def react_index
    flights = Flight.where( to: params[:to], from: params[:from] )

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @flight= Flight.find params[:id]

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @flight = Flight.find params[:id]

SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "flights" SET "scheduled" = $1, "to" = $2, "from" = $3, "flight_id" = $4, "plane_id" = $5, "updated_at" = $6 WHERE "flights"."id" = $7  [["scheduled", "2021-12-01"], ["to", "Melbourne"], ["from", "Tasmania"], ["flight_id", 656], ["plane_id", 1], ["updated_at", "2021-01-06 00:55:50.681636"], ["id", 3]]
---
  def update
    @flight = Flight.find params[:id]
    @flight.update flight_params