app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
  def index
    headers['Access-Control-Allow-Origin'] = '*'
    render json: Reservation.all